#+TITLE: 3D Taylor-Green Vortex Comparison
#+AUTHOR: Paul Bartholomew

#+LATEX_HEADER: \usepackage{fullpage}
#+LATEX_HEADER: \usepackage{nicefrac}
#+LATEX_HEADER: \hypersetup{colorlinks}

#+OPTIONS: toc:nil

#+BEGIN_abstract 
As part of the verification of =Xcompact3D= we simulate the Taylor-Green vortex and compare with
results from a reference 6^{th} order compact finite difference code provided by Eric Lamballais.
#+END_abstract

#+TOC: :headlines 2

** Data availability

The data in the form of enstrophy and kinetic energy evolutions are available for the reference and
comparison simulations [[https://imperialcollegelondon.box.com/s/p0tbirf3ps034yndm5sq10j2pkhvbt85][here]] and [[https://imperialcollegelondon.box.com/s/w7prpf8bheykw91lhlv7a0835f1pb37r][here]] respectively.
For post processing these datasets are expected to be placed in =./x3d/time_evol.dat= and
=./e3d/time_evol.dat= respectively, the shell script in listing\nbsp[[src:dl-ke-enstr.sh]] downloads and
places the files appropriately.
Also instantaneous snapshots of the flow field are downloaded for later post processing.

#+CAPTION: Shell script to download data for kinetic energy and enstrophy comparison.
#+NAME: src:dl-ke-enstr.sh
#+begin_src sh
  #!/bin/bash

  # Download links
  BOX_ADDR=https://imperialcollegelondon.box.com/shared/static
  E3D_DATA=p0tbirf3ps034yndm5sq10j2pkhvbt85.dat
  X3D_DATA=w7prpf8bheykw91lhlv7a0835f1pb37r.dat
  X3D_VISU=78lzzvm9hwe9aff2zb32bu1uvp9qbcbx.xz
  X3D_PARA=f8d24cs9x8xty95bt69jlckbq8dsi2a3.prm

  # Download data
  wget $BOX_ADDR/$E3D_DATA
  wget $BOX_ADDR/$X3D_DATA
  wget $BOX_ADDR/$X3D_VISU
  wget $BOX_ADDR/$X3D_PARA

  # Make directories
  mkdir ./e3d
  mkdir ./x3d

  # Move data to appropriate locations (untar as necessary)
  mv $E3D_DATA ./e3d/time_evol.dat
  mv $X3D_DATA ./x3d/time_evol.dat
  mv $X3D_VISU ./x3d/data.tar.xz && \
      tar -C x3d/ -xvf x3d/data.tar.xz --strip-components 1
#+end_src

#+RESULTS: src:dl-ke-enstr.sh
| data/vort017 |
| data/ux010   |
| data/ux004   |
| data/uy011   |
| data/vort004 |
| data/uy001   |
| data/uz019   |
| data/uy012   |
| data/uz001   |
| data/uy006   |
| data/vort016 |
| data/ux016   |
| data/uz014   |
| data/ux007   |
| data/uy016   |
| data/ux012   |
| data/uy005   |
| data/uz006   |
| data/vort010 |
| data/ux018   |
| data/vort013 |
| data/uy020   |
| data/uy010   |
| data/uz009   |
| data/vort009 |
| data/vort007 |
| data/ux013   |
| data/vort012 |
| data/ux020   |
| data/uz018   |
| data/vort014 |
| data/uz016   |
| data/uz008   |
| data/uy013   |
| data/ux008   |
| data/uy018   |
| data/uz012   |
| data/uy014   |
| data/uy019   |
| data/ux002   |
| data/uy003   |
| data/vort008 |
| data/uz015   |
| data/uz017   |
| data/uz005   |
| data/uz011   |
| data/uy009   |
| data/vort002 |
| data/uy015   |
| data/uy007   |
| data/uy017   |
| data/vort015 |
| data/uy004   |
| data/vort019 |
| data/ux005   |
| data/vort006 |
| data/uy008   |
| data/vort018 |
| data/uz007   |
| data/ux009   |
| data/ux006   |
| data/ux003   |
| data/ux017   |
| data/ux019   |
| data/uy002   |
| data/vort005 |
| data/uz002   |
| data/vort011 |
| data/ux015   |
| data/uz004   |
| data/vort001 |
| data/vort003 |
| data/uz010   |
| data/vort020 |
| data/ux014   |
| data/ux001   |
| data/uz013   |
| data/uz020   |
| data/ux011   |
| data/uz003   |

